I have two examples.

From my point of view it is nightmare. I spend few nights debugging this problem. It's crazy because data gathered form data source are available for outputs (I got correct values), but not for other resources during apply (and resource creation fails).

First example is taken from Google docs: https://registry.terraform.io/modules/Harjot1Singh/kubernetes-engine/google/latest/submodules/auth

Second one is similar solution suggested for Vmware - you fetch i.e. VM template parameters () to create new VM: https://registry.terraform.io/providers/hashicorp/vsphere/latest/docs/resources/virtual_machine#cloning-and-customization

In both cases resource creation depends on data source values.

### k8s provider

```
terraform {
  required_version = ">= 1.0.0"

  required_providers {
    google = {
      source  = "hashicorp/google"
      version = ">= 3.50.0"
    }
    google-beta = {
      source  = "hashicorp/google-beta"
      version = ">= 3.50.0"
    }
    kubernetes = {
      source  = "hashicorp/kubernetes"
      version = "2.10.0"
    }
  }
}

provider "google" {
  credentials = local.secrets.provider-google
  project     = local.gcp.project_name
  region      = local.gcp.region
  zone        = local.gcp.zone
}

provider "kubernetes" {
  cluster_ca_certificate = module.gke_auth.cluster_ca_certificate
  host                   = module.gke_auth.host
  token                  = module.gke_auth.token
}

module "gke_auth" {
  source       = "terraform-google-modules/kubernetes-engine/google//modules/auth"
  version      = "21.2.0"
  project_id   = local.secrets.provider-google
  cluster_name = local.gke.cluster_name
  location     = local.gcp.region
}

resource "local_file" "kubeconfig" {
  content  = module.gke_auth.kubeconfig_raw
  filename = "${path.module}/kubeconfig"
}

resource "kubernetes_namespace" "ns" {
  metadata {
    name = "terraform-example-namespace"
  }
}
```

#### Steps to Reproduce
```
terraform init
terraform apply
```

#### Current result

Example below is for GKE and k8s - I think much popular than vmware.

In both cases resource can not be created, because data from data sources is missing.

In case of k8s, cluster credentials depend on values from data source and namespace creation fails - because data source values are not yet available.

```
% terraform apply
module.gke_auth.data.google_client_config.provider: Reading...
module.gke_auth.data.google_container_cluster.gke_cluster: Reading...
module.gke_auth.data.google_client_config.provider: Read complete after 0s [id=projects/av20-dev/regions/europe-west3/zones/europe-west3-a]
module.gke_auth.data.google_container_cluster.gke_cluster: Read complete after 1s

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_namespace.ns will be created
  + resource "kubernetes_namespace" "ns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "terraform-example-namespace"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # local_file.kubeconfig will be created
  + resource "local_file" "kubeconfig" {
      + content              = (sensitive)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./kubeconfig"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

local_file.kubeconfig: Creating...
local_file.kubeconfig: Creation complete after 0s [id=2d778cb9815031fa7e87b9887a569151e0f7d72a]
kubernetes_namespace.ns: Creating...
╷
│ Error: Post "http://localhost/api/v1/namespaces": dial tcp [::1]:80: connect: connection refused
│
│   with kubernetes_namespace.ns,
│   on main.tf line 60, in resource "kubernetes_namespace" "ns":
│   60: resource "kubernetes_namespace" "ns" {
│
╵
```

### Vmware

Look on vmware provider docs: https://registry.terraform.io/providers/hashicorp/vsphere/latest/docs/resources/virtual_machine#cloning-and-customization and focus on two objects:

```
data "vsphere_virtual_machine" "template" {
  name          = "ubuntu-server-template"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

resource "vsphere_virtual_machine" "vm" {
  name             = "hello-world"
  (...)
  disk {
    label            = "disk0"
    size             = data.vsphere_virtual_machine.template.disks.0.size
    thin_provisioned = data.vsphere_virtual_machine.template.disks.0.thin_provisioned
  }
```

Resource creation `vsphere_virtual_machine.vm` will fail, because vmware expects i.e. `disk.size` parameter to be provided. As you can see, it's gathered from data source `data.vsphere_virtual_machine.template`.